app/Controllers/Produtos.php

SELECT *
FROM `produtos`
---
    public function list()
    {
        $data = $this->produtosModel->findAll();

INSERT INTO `produtos` (`nome`, `valor`) VALUES ('Pc Gamer', '5000')
---
    public function create()
    {
        $response = [];

        // Validar o token
        if ($this->_validaToken() == true) {
            // Pegar os dados (que vieram no body da requisição) para salvar
            $newProduto['nome'] = $this->request->getPost('nome');
            $newProduto['valor'] = $this->request->getPost('valor');

            try {
                if ($this->produtosModel->insert($newProduto)) { // Corrigido para $this->produtosModel